package com.itheima.demo9_成员变量和局部变量的区别;

/**
 * @Author：pengzhilin
 * @Date: 2020/9/5 14:53
 */
public class Test {
    public static void main(String[] args) {
        /*
            成员变量和局部变量的区别:
                位置不同:
                    成员变量定义在类中访问外
                    局部变量定义在方法中或者方法声明之上
                内存中位置不同:
                    成员变量在堆区
                    局部变量在栈区
                生命周期不同:
                    成员变量是随着对象的创建而存在,随着对象的销毁而销毁
                    局部变量是随着方法的调用而存在,随着方法的执行完毕而销毁
                默认值不同:
                    成员变量有默认值
                    局部变量没有默认值

         */
    }
}
